---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PipeRoughness
source: html/8ed75f79-185e-b229-36d0-7cab22e416ed.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PipeRoughness Property

"Roughness"

## Syntax (C#)
```csharp
public static ForgeTypeId PipeRoughness { get; }
```